posts/2016-01-06-prayer-before-travelling.org
#+date: <2016-01-06>
#+filetags: prayer religion
#+title: Prayer Before Traveling

Prayer for an evening of frantic packing before a trip to Africa. I'll be teaching philosophy of religion at a Baptist seminary in Ghana for the next two weeks.

Lord,

If I really need it,\\
help me to remember to pack it.

If I really don't need it,\\
help me to resist the temptation to take it.

And if I need it and forget it,\\
may it be something I would have lost over there anyway.

/Amen/
